{
  "backend/main.mo": "Empty Motoko actor file serving as a placeholder for future backend implementation.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including frontend-only code generation, JSX components, voice-based mock interviews, OTP authentication, dashboard layout, and resume upload functionality with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, services, and CSS files describing their functionality and purpose.",
  "frontend/.eslintrc.cjs": "ESLint configuration for TypeScript and React with recommended rules and react-refresh plugin.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors, borders, and sidebar styling.",
  "frontend/index.html": "HTML entry point for the VidyaMitra application with root div and module script reference.",
  "frontend/src/App.jsx": "Empty file, likely replaced by App.tsx.",
  "frontend/src/App.tsx": "Main application component using TanStack Router to define public and protected routes with authentication context, including login, register, dashboard, and feature pages.",
  "frontend/src/components/DashboardLayout.jsx": "Empty file, likely replaced by DashboardLayout.tsx.",
  "frontend/src/components/DashboardLayout.tsx": "Layout wrapper component that combines Navbar, Sidebar, and main content area for authenticated pages.",
  "frontend/src/components/Navbar.jsx": "Empty file, likely replaced by Navbar.tsx.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component displaying app branding, user email, and logout button with navigation handling.",
  "frontend/src/components/Sidebar.jsx": "Empty file, likely replaced by Sidebar.tsx.",
  "frontend/src/components/Sidebar.tsx": "Sidebar navigation component with links to Dashboard, Resume, Roadmap, Quiz, Progress, and Mock Interview pages with active state highlighting.",
  "frontend/src/components/VoiceRecorder.jsx": "Empty file, likely replaced by VoiceRecorder.tsx.",
  "frontend/src/components/VoiceRecorder.tsx": "Voice recording component with microphone permission handling, start/pause/resume/stop controls, timer, and audio playback functionality for recorded audio.",
  "frontend/src/context/AuthContext.jsx": "Empty file, likely replaced by AuthContext.tsx or implemented elsewhere.",
  "frontend/src/context/AuthContext.tsx": "Provides React context for authentication state management, including login/logout functions and persistence via localStorage. Exports AuthProvider component and useAuth hook for consuming auth state.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor using React Query, handling both authenticated and anonymous actors. Invalidates dependent queries when the actor changes based on identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication integration for ICP, including InternetIdentityProvider context and useInternetIdentity hook. Manages login status, identity delegation, and AuthClient lifecycle with configurable options.",
  "frontend/src/main.jsx": "Empty file with no content.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClientProvider and InternetIdentityProvider wrappers. Initializes React app and mounts to DOM.",
  "frontend/src/pages/Dashboard.jsx": "Empty file with no content.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard home page component displaying welcome message, progress statistics (roadmap completion, quizzes taken, last activity), and quick action buttons for key features. Uses DashboardLayout and loads stats from progressService.",
  "frontend/src/pages/Login.jsx": "Empty file with no content.",
  "frontend/src/pages/Login.tsx": "Login page component implementing two-step authentication flow: email input to request OTP, then OTP verification (hardcoded as '123456' for demo). Uses AuthContext for login and navigates to dashboard on success.",
  "frontend/src/pages/MockInterview.jsx": "Empty file with no content.",
  "frontend/src/pages/MockInterview.tsx": "Mock interview practice page with voice recording functionality, displaying AI-generated questions sequentially. Manages interview state, recordings per question, navigation between questions, and completion flow using VoiceRecorder component.",
  "frontend/src/pages/Progress.jsx": "Empty file with no content.",
  "frontend/src/pages/Progress.tsx": "Progress tracking page displaying user statistics including roadmap completion percentage, total quizzes taken, last activity date, and recent quiz history with scores. Loads data from progressService on mount.",
  "frontend/src/pages/Quiz.jsx": "Empty file with no content.",
  "frontend/src/pages/Quiz.tsx": "Quiz page component that generates topic-based quizzes, handles question navigation, tracks user answers, calculates scores, and saves results to localStorage.",
  "frontend/src/pages/Register.jsx": "Empty file (no content).",
  "frontend/src/pages/Register.tsx": "Registration page component with two-step OTP verification flow that collects user name and email, sends mock OTP, verifies it, and saves user data to localStorage before redirecting to login.",
  "frontend/src/pages/Resume.jsx": "Empty file (no content).",
  "frontend/src/pages/Resume.tsx": "Resume upload page that allows users to select and upload resume files (PDF, DOC, DOCX), displays mock AI analysis results with score, strengths, and improvement suggestions, and saves upload status to localStorage.",
  "frontend/src/pages/Roadmap.jsx": "Empty file (no content).",
  "frontend/src/pages/Roadmap.tsx": "Career roadmap page that generates learning paths for job roles, displays topics with expandable subtopics, allows users to track progress status (not started/in progress/completed), and persists data to localStorage.",
  "frontend/src/routes/ProtectedRoute.jsx": "Empty file (no content).",
  "frontend/src/services/apiService.jsx": "Empty file (no content).",
  "frontend/src/services/apiService.ts": "Centralized API service providing mock implementations for login, registration, resume upload, roadmap generation, and quiz generation with simulated delays, designed to be replaced with real backend API calls.",
  "frontend/src/services/mockData.jsx": "Empty file (no content).",
  "frontend/src/services/mockData.ts": "Mock data service that provides a list of common interview questions for frontend testing purposes.",
  "frontend/src/services/progressService.jsx": "Empty file (no content).",
  "frontend/src/services/progressService.ts": "Progress tracking service that calculates roadmap completion percentage, retrieves quiz history, formats activity dates, and aggregates user progress statistics including recent quizzes.",
  "frontend/src/services/quizService.jsx": "Empty file (no content).",
  "frontend/src/services/quizService.ts": "Defines quiz data structures (Question, QuizData, QuizResult) and provides a generateQuiz function that returns mock quiz questions for JavaScript, React, or generic topics.",
  "frontend/src/services/roadmapService.jsx": "Empty file with no content.",
  "frontend/src/services/roadmapService.ts": "Defines roadmap data structures (Topic, RoadmapData) and provides functions to generate mock learning roadmaps for job roles, plus save/load roadmap progress to/from localStorage.",
  "frontend/src/styles/auth.css": "Styles for authentication pages (login/register) including centered card layout, form inputs, buttons, and success/error message styling.",
  "frontend/src/styles/dashboard.css": "Styles for the dashboard page including stats grid with hover effects, stat cards with icons, and quick action buttons.",
  "frontend/src/styles/global.css": "Global base styles including CSS reset, typography defaults, link and button styles, and utility classes applied across the application.",
  "frontend/src/styles/layout.css": "Defines the main dashboard layout structure with flexbox for navbar, sidebar, and main content area, plus responsive adjustments.",
  "frontend/src/styles/mockInterview.css": "Styles for mock interview page including interview start card, question display, progress bar, navigation buttons, and interview completion review section.",
  "frontend/src/styles/navbar.css": "Styles for the top navigation bar with brand logo, user email display, logout button, and responsive mobile layout.",
  "frontend/src/styles/progress.css": "Styles for the progress tracking page including stat cards with progress bars, quiz history items with scores, and color-coded performance indicators.",
  "frontend/src/styles/quiz.css": "Styles for the quiz page including topic input card, question display, answer options with hover/selected states, navigation buttons, and results display with circular score visualization.",
  "frontend/src/styles/resume.css": "Styles for the resume upload page featuring file input wrapper with dashed border, upload button, analysis section with circular score display, and grid layout for strengths/improvements cards.",
  "frontend/src/styles/roadmap.css": "Styles for the roadmap page with job role input, topic cards with expandable sections, status dropdowns (not-started/in-progress/completed) with color coding, and responsive design for mobile.",
  "frontend/src/styles/sidebar.css": "Styles for sidebar navigation with vertical layout on desktop and horizontal scrollable layout on mobile, including active state indicators and hover effects.",
  "frontend/src/styles/variables.css": "CSS custom properties defining the application's design system including color palette (primary blue, secondary sky blue, accent green), spacing scale, border radius values, shadows, and transition timings.",
  "frontend/src/styles/voiceRecorder.css": "Styles for voice recorder component with recording indicator animation, timer display, control buttons (record/pause/resume/stop), audio playback section, and delete functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors using OKLCH color space, container settings, border radius, shadows, and accordion animations, plus typography and container query plugins.",
  "project_state.json": "Project metadata describing VidyaMitra as an AI career guidance platform with React + Vite frontend, plain CSS styling, authentication, resume analysis, roadmap generation, quiz system, and voice-based mock interviews using localStorage for persistence."
}